

# RIP 命令

## `accept-lifetime`

- 命令：
  + `accept-lifetime <start-time> {<end-time>| duration<seconds>| infinite}`
  + `no accept-lifetime`
- 功能：使用本命令指明密匙链上的一个密匙接收为合法的时间段。本命令的 no 操作取消此配置
- 参数：
  + `<start-time>`参数指明时间段的起始时间，它的形式如下：
  + `<start-time>={<hh:mm:ss> <month> <day> <year>|<hh:mm:ss> <day> <month><year>}`
    + `<hh:mm:ss>`用小时、分钟和秒的指明accept-lifetime 生效的具体时间；
    + `<day>`指明生效的具体日期，取值范围1-31；
    + `<month>`指明生效的具体月份，用月份英文的头三个字母表示，如Jan；
    + `<year>`指明开始生效的具体年份，取值范围1993-2035；
  + `<end-time>`参数指明时间段的到期时间，它的形式如下：
  + `<end-time>={<hh:mm:ss> <month> <day> <year>|<hh:mm:ss> <day> <month><year>}`
    + `<hh:mm:ss>`用小时、分钟和秒的指明accept-lifetime 到期的具体时间；
    + `<day>`指明到期的具体日期，取值范围1-31；
    + `<month>`指明到期的具体月份，用月份英文的头三个字母表示，如Jan；
    + `<year>`指明到期的具体年份，取值范围1993-2035；
  + `<seconds>`密匙持续有效的时间长短，以秒为单位，取值范围1-2147483646；
  + `infinite` 密匙永远不过期
- 缺省情况：没有缺省配置
- 命令模式：keychain-key 模式
- 使用指南：无
- 举例：下面的例子显示了在名为 mychain 的密匙链上为 key 1 所作的 accept-lifetime 设置

```text
  Switch# config terminal
  Switch(config)# key chain mychain
  Switch(config-keychain)# key 1
  Switch(config-keychain-key)# accept-lifetime 03:03:01 Dec 3 2004 04:04:02 Oct 6 2006
```

相关命令：

```text
  key
  key-string
  key chain
  send-lifetime
```

## `address-family ipv4`

- 命令：
  + `address-family ipv4 vrf <vrf-name>`
  + `no address-family ipv4 vrf <vrf-name>`
- 功能：配置本命令使能 VRF 间路由信息交换并且进入地址族模式，本命令的 no 操作删除与该 VPN 路由/转发实例相关联的 RIP 实例
- 参数：`<vrf-name>`指明了 VPN 路由/转发实例的名称
- 命令模式：路由模式
- 使用指南：本命令只用于 PE 路由器。在使用本命令前，必须首先使用命令 ip vrf 生成一个 VPN 路由/转发实例，然后使用本命令可以将该 VPN 路由/转发实例与 RIP 实例关联起来
- 举例：

```text
  Switch# config terminal
  Switch(config)# router rip
  Switch(config-router)# address-family ipv4 vrf VRF1
  Switch(config-router-af)#
```

## `clear ip rip route`

- 命令：
  + `clear ip rip route {<A.B.C.D/M>|kernel|static|connected|rip|ospf|isis|bgp|all}`
- 功能：从 RIP 路由表中清除特定的路由
- 参数：
  + `<A.B.C.D/M>` 从 RIP 路由表中清除与目的地址相符的路由，`A.B.C.D/M `表示目的地址的 IP 地址前缀与前缀长度；
  + kernel 从 RIP 路由表中删去核心路由；
  + static 从 RIP 路由表中删去静态路由；
  + connected 从 RIP 路由表删去直连路由；
  + rip 从 RIP 路由表中仅删去 RIP 路由；
  + ospf 从 RIP 路由表中仅删去 OSPF 路由；
  + isis 从 RIP 路由表中仅删去 ISIS 路由；
  + bgp 从 RIP 路由表中仅删去 BGP 路由；
  + all 删去 RIP 路由表中的所有路由
- 缺省情况：没有缺省配置
- 命令模式：特权模式
- 使用指南：使用带 all 参数的本命令时，将删除 RIP 路由表中的所有路由。删除的路由除了 rip 路由外，其他引入的所有路由都会立即恢复。动态学习到的 RIP 路由只能通过再次学习而恢复
举例：

```text
  Switch# clear ip rip route 10.0.0.0/8
  Switch# clear ip rip route ospf
```

## `debug rip`

- 命令：
  + `debug rip [events| nsm| packet[recv|send][detail]| all]`
  + `no debug rip [events| nsm| packet[recv|send][detail]| all]`
- 功能：用来打开 RIP 的各种调试开关，显示各类调试信息。 no 操作关闭相应的调试开关
- 参数：
  +  events 表示显示 RIP events 的调试信息；
  +  nsm 表示显示 RIP 与 NSM 的之间的通讯信息；
  +  packet 表示显示 RIP 数据报的调试信息；
  +  recv 表示显示接收到的数据报的信息；
  +  send 表示显示发出的数据报的信息；
  +  detail 表示显示接收或者发出的数据报的具体信息
- 默认情况：不打开调试开关
- 命令模式：特权模式与全局模式
- 举例：

```text
  Switch# debug rip packet
  Switch#1970/01/01 01:01:43 IMI: SEND[Vlan1]: Send to 224.0.0.9:520
  1970/01/01 01:01:43 IMI: SEND[Vlan1]: Send to 224.0.0.9:520
  1970/01/01 01:01:47 IMI: RECV[Vlan1]: Receive from 20.1.1.2:520
```

## `debug rip redistribute message send`

- 命令：
  + `debug rip redistribute message send`
  + `no debug rip redistribute message send`
- 功能：打开 RIP 进程引入其他 OSPF 不同进程、 BGP 等协议的路由的命令下发调试开关本命令的no 操作为关闭RIP 进程引入其他OSPF 不同进程、BGP 等协议的路由的命令下发调试开关
- 参数：无
- 缺省情况：调试开关关闭
- 命令模式：特权模式
- 使用指南：无
举例：

```text
  Switch#debug rip redistribute message send
  Switch#no debug rip redistribute message send
```

## `debug rip redistribute route receive`

- 命令：
  + `debug rip redistribute route receive`
  + `no debug rip redistribute route receive`
- 功能：打开 RIP 进程收到 nsm 发来的路由信息的调试开关。本命令的 no 操作为关闭 RIP 进程收到 nsm 发来的路由信息的调试开关
- 参数：无
- 缺省情况：调试开关关闭
- 命令模式：特权模式
- 使用指南：无
- 举例：

```text
  Switch#debug rip redistribute route receive
  Switch#no debug rip redistribute route receive
```

## `default-information originate`

- 命令：
  + `default-information originate`
  + `no default-information originate`
- 功能：允许将网络 0.0.0.0 重新分配到 RIP 中，本命令的 no 操作禁用此功能
- 参数：无
- 缺省情况：禁用
- 命令模式：路由模式与地址族模式
- 使用指南：本命令告诉路由器将目的地为 0.0.0.0 的默认路由插入到 RIP 路由数据库中，并且与通告其他路由一样来通告该路由。
- 举例：

```text
  Switch# config terminal
  Switch(config)# router rip
  Switch(config-router)# default-information originate
```

## `default-metric`

- 命令：
  + `default-metric <value>`
  + `no default-metric`
- 功能：设定引入路由的缺省路由权值；本命令的 no 操作恢复缺省值1
- 参数：`<value>`为所要设定的路由权值，取值范围 1～16
- 缺省情况：缺省的路由权值为 1 
- 命令模式：路由模式与地址族模式
- 使用指南：default-metric 命令用于设定将其它路由协议的路由引入到 RIP 路由时使用的缺省路由权值。
  当使用 redistribute 命令引入其它协议的路由时，如果不指定具体的路由权值，则以 default-metric 所指定的缺省路由权值引入
- 举例：

```text
  设定在RIP 路由中引入其它路由协议的缺省路由权值为3。
  Switch(config-router)#default-metric 3
  相关命令：redistribute
```
## `distance`

- 命令：
  + `distance <number> [<A.B.C.D/M> ] [<access-list-name|access-list-number >]`
  + `no distance [<A.B.C.D/M> ]`
- 功能：利用本命令设置管理距离。本命令的 no 操作恢复缺省值 120
- 参数：`<number>`指定距离的值，取值范围 1-255 。`<A.B.C.D/M>`指定网络前缀和前缀长度`< access-list-name|access-list-number >`指定所应用的访问列表号或者名字。
- 缺省情况：缺省情况下 RIP 的管理距离为 120
- 命令模式：路由模式与地址族模式
- 使用指南：当到达同一目的地存在来自于两个不同路由协议的路由时，管理距离用来选择路由。路由协议的管理距离值越小，表明由该协议得到的路由越可靠
- 举例：

```text
  Switch# config terminal
  Switch(config)# router rip
  Switch(config-router)# distance 8 10.0.0.0/8 mylist
```

## `distribute-list`

- 命令：
  + `distribute-list{<access-list-number|`
  + `access-list-name> |prefix<prefix-list-name>} {in|out} [<ifname>]`
  + `no distribute-list{<access-list-number|`
  + `access-list-name> |prefix<prefix-list-name>} {in|out} [<ifname>]`
- 功能：本命令使用访问列表或者前缀列表来过滤发送与接收的路由更新报文。本命令的 no 操作取消路由过滤功能
- 参数：
  `<access-list-number |access-list-name>` 要应用的访问列表号或者名字
  `<prefix-list-name>`是要应用的前缀列表的名字
  `<ifname>`指定应用路由过滤的接口名
- 缺省情况：缺省情况下 RIP 禁用此功能
- 命令模式：路由模式与地址族模式
- 使用指南：如果不指定接口：过滤器将应用于所有接口
- 举例：

```text 
  Switch# config terminal
  Switch(config)# router rip
  Switch(config-router)# distribute-list prefix myfilter in vlan 1
```

## `exit-address-family`

- 命令：
  + `exit-address-family`
- 功能：退出地址族模式
- 命令模式：地址族模式
- 举例：

```text
  Switch(config)# router rip
  Switch(config-router)# address-family ipv4 vrf IPI
  Switch(config-router-af)# exit-address-family
  Switch(config-router)#
```

## `ip rip aggregate-address`

- 命令：
  + `ip rip aggregate-address A.B.C.D/M`
  + `no ip rip aggregate-address A.B.C.D/M`
- 功能：配置 RIP 聚合路由。本命令的 no 操作取消配置 RIP 聚合路由
- 参数：`A.B.C.D/M:IPv4` 地址及掩码长度
- 命令模式：路由模式或接口配置模式
- 缺省情况：默认没有配置聚合路由
- 使用指南：若是在路由模式下配置聚合路由，则必须先启用 RIP 协议。若是在接口配置模式下，则未启用 RIP 协议也可以配置聚合路由，但是在接口上启用协议后才能生效
- 举例：

```text
配置全局聚合路由 192.168.20.0/22。
Switch(config)#router rip
Switch(config-router)#ip rip agg 192.168.20.0/22
```

## `ip rip authentication key-chain`

- 命令：
  + `ip rip authentication key-chain <name-of-chain>`
  + `no ip rip authentication key-chain`
- 功能：使用本命令在一个接口上使能 RIPV2 认证并且配置所使用的密匙链。本命令的 no 操作取消认证
- 参数：`<name-of-chain>`是所使用的密匙链的名字，字符串中可以包括空格，输入以回车结束，字符串长度不超过 256
- 缺省情况：缺省情况下不配置
- 命令模式：接口配置模式
- 使用指南：
  如果只配置认证模式，不配置接口所使用的密匙链或者密码，认证是完全不起用的。如果配置本命令前没有配置 mode ，配置本命令后会将 mode 设置为明文认证。本命令的 no 操作将会取消认证，但是不表示会将 mode 设置为无认证类型，只是发送或接收数据包时不会进行认证处理。可以输入 ip rip authentication key-chain my key ，表示密匙链名字是 my key ，共 6 个字符
- 举例：

```text
Switch#config terminal
Switch(config)# interface vlan 1
Switch(Config-if-Vlan1)# ip rip authentication key-chain my key
相关命令：key, key chain
```

## `ip rip authentication mode`

- 命令：
  + `ip rip authentication mode {text|md5}`
  + `no ip rip authentication mode {text|md5}`
- 功能：设置认证使用的类型；本命令的 no 操作为恢复缺省认证类型即文本认证
- 参数： text 表示文本认证； md5 表示 MD5 认证
- 缺省情况：文本认证
- 命令模式：接口配置模式
- 使用指南：
  RIP-I 不支持验证，RIP-II 支持两种认证：文本认证（即 Simple 认证）和数据报认证（即 MD5 认证）。本命令需要结合 ip rip authentication key-chain 或 ip rip authenticationstring 来使用，单独配置不会进行认证处理
- 举例：

```text
  Switch#config terminal
  Switch(config)# interface vlan 1
  Switch(Config-if-Vlan1)# ip rip authentication mode md5
  相关命令：ip rip authentication key-chain，ip rip authentication string
```
## `ip rip authentication string`

- 命令：
  + `ip rip authentication string <text>`
  + `no ip rip authentication string`
- 功能：设置 RIP 认证使用的密码。本命令的 no 操作取消认证
- 参数：`<text>`是认证所使用的密码，长度为 1-16 个字符。密码中可以包括空格，输入以回车作为结束
- 命令模式：接口模式
- 使用指南：
  配置了本命令，就不能配置 ip rip authentication key chain 。在使用 MD5 认证时需要使用 key id 值，如果使用本命令配置命令， key id 值相当于 1 。如果配置本命令前没有配置 mode ，配置本命令后会将 mode 设置为明文认证。本命令的 no 操作将会取消认证，但是不表示会将 mode 设置为无认证类型，只是发送或接收数据包时不会进行认证处理。可以输入 ip rip authentication string aaa aaa，表示密码是 aaa aaa，供 7 个字符
- 举例：

```text
  Switch# config terminal
  Switch(config)# interface vlan 1
  Switch(Config-if-Vlan1)# ip rip authentication string guest
相关命令：ip rip authentication mode
```

## `ip rip authentication cisco-compatible`

- 命令：
  + `ip rip authentication cisco-compatible`
  + `no ip rip authentication cisco-compatible`
- 功能：配置本命令后，在配置了明文认证或者 MD5 认证的情况下，可以接收 cisco 的 RIP 报文，no 命令恢复缺省配置
- 参数：无
- 缺省情况：缺省不配置
- 命令模式：接口模式
- 使用指南： cisco 路由器在配置了认证后，如果要发送的路由条目超过 25 条，则 RIP 报文的长度超过协议规定的标准长度。配置本命令后，可以接收超过标准长度的 RIP 报文，否则将拒绝此类报文
- 举例：

```text
  Switch# config terminal
  Switch(config)# interface vlan 1
  Switch(Config-if-Vlan1)# ip rip authentication cisco-compatible
相关命令：ip rip authentication mode
```

## `ip rip receive-packet`

- 命令：
  + `ip rip receive-packet`
  + `no ip rip receive-packet`
- 功能：设置接口能够接收 RIP 报文；本命令的 no 操作为接口不能接收 RIP 报文
- 缺省情况：接口缺省接收 RIP 报文 
- 命令模式：接口配置模式
- 举例：

```text
  Switch# config terminal
  Switch(config)# interface vlan 1
  Switch(Config-if-Vlan1)# ip rip receive-packet
相关命令：ip rip send-packet
```

## `ip rip receive version`

- 命令：
  + `ip rip receive version { 1 | 2|1 2 }`
  + `no ip rip receive version`
- 功能：设置接口接收 RIP 报文的版本信息。缺省接收 RIP 版本 2 ；本命令的 no 操作恢复使用 version 命令所设置的值
- 参数：1 和 2 分别表示 RIP 版本 1 和 RIP 版本 2，1 2 表示 RIP 版本 1、2
- 缺省情况：Version 2
- 命令模式：接口配置模式
- 举例：

```text
  Switch# config terminal
  Switch(config)# interface vlan 1
  Switch(Config-if-Vlan1)# ip rip receive version 1 2
相关命令：version
```

## `ip rip send-packet`

- 命令：
  + `ip rip send-packet`
  + `no ip rip send-packet`
- 功能：设置接口能够发送 RIP 报文；本命令的 no 操作为接口不能发送 RIP 报文
- 缺省情况：接口缺省发送 RIP 报文
- 命令模式：接口配置模式
- 举例：

```text
  Switch# config terminal
  Switch(config)# interface vlan 1
  Switch(Config-if-Vlan1)# ip rip send-packet
  相关命令：ip rip receive-packet
```

## `ip rip send version`

- 命令：
  + `ip rip send version { 1 | 2 | 1-compatible | 1 2}`
  + `no ip rip send version`
- 功能：设置接口发送 RIP 报文的版本信息。缺省发送 RIP 版本 2 ；本命令的 no 操作恢复使用 version 命令所设置的值
- 参数：1 和 2 分别表示 RIP 版本 1 和 RIP 版本 2 ， 1 2 表示 RIP 版本 1、2
- 缺省情况： Version 2
- 命令模式：接口配置模式。]
- 举例：

```text
  Switch# config terminal
  Switch(config)# interface vlan 1
  Switch(Config-if-Vlan1)# ip rip send version 1
  相关命令：version
```

## `ip rip split-horizon`
## `key`
## `key chain`
## `key-string`
## `maximum-prefix`
## `neighbor`
## `network`
## `offset-list`
## `passive-interface`
## `recv-buffer-size`
## `redistribute`
## `redistribute ospf`（vrf 命令）
## `route`
## `router rip`
## `send-lifetime`
## `show debugging rip`
## `show ip protocols rip`
## `show ip rip`
## `show ip rip database`
## `show ip rip database vrf`
## `show ip rip interface`
## `show ip rip interface vrf`
## `show ip rip aggregate`
## `show ip rip redistribute`
## `show ip vrf`
## `timers basic`
## `version`